frontend/views/business/_form.php

	<div class="row">
	<div class="col-md-6">
	<div><h3 class="headline h mykazi_red">Your Work</h4></div>
	 <?= $form->field($bWorks, 'workTypeID')->dropDownList(
	 		ArrayHelper::map(Worktypes::find()->all(), 'id', 'name'),
	 		['prompt'=>'', 'multiple'=>'multiple']
	 		)?>
---
SELECT * FROM `worktypes`