frontend/controllers/UsersController.php

SELECT * FROM `users` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Users::findOne($id)) !== null) {