common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['email' => $username, 'isActive' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='efgwg') AND (`status`=10)