frontend/views/jobs/_form.php

SELECT * FROM `worktypes`
---

    <?= $form->field($model, 'streetAddress')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'workTypeID')->dropDownList(
	 		ArrayHelper::map(Worktypes::find()->all(), 'id', 'name'),
	 		['prompt'=>'']
	 		)?>